In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import warnings 
warnings.filterwarnings('ignore')

# DataFrame

## 2D------>Hetrogeneous-------->Size Mutable

In [4]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
#convert list into dataframe

mylist=[[1,2,3,4],[5,6,7,8]]
df=pd.DataFrame(mylist,columns=['a','b','c','d'])
df

   a  b  c  d
0  1  2  3  4
1  5  6  7  8

In [6]:
#convert dictionery into dataframe

d={'names':['sejal','raju','ram','sita'],'age':[25,25,24,26]}
df1=pd.DataFrame(d,index=['rank1','rank2','rank3','rank4'])

In [7]:
df1

       names  age
rank1  sejal   25
rank2   raju   25
rank3    ram   24
rank4   sita   26

## Reshape

In [8]:
df2=pd.DataFrame(np.arange(1,5).reshape(2,2),index=['a','b'],columns=['aa','bb'])

In [9]:
df2

   aa  bb
a   1   2
b   3   4

# Functions in DataFrame

In [10]:
dt={'Names':['prachiti','riya','raj','aditi','rahul','rina','radha','anuj'],
    'age':[22,23,25,28,29,31,21,24],
    'ratings':[4.23,2.32,5.55,2.96,4.32,4.55,6.54,4.44]
    }
df3=pd.DataFrame(dt)
df3

      Names  age  ratings
0  prachiti   22     4.23
1      riya   23     2.32
2       raj   25     5.55
3     aditi   28     2.96
4     rahul   29     4.32
5      rina   31     4.55
6     radha   21     6.54
7      anuj   24     4.44

## 1. transpose - converting rows into columns and columns into rows

In [11]:
df3.T

                0     1     2      3      4     5      6     7
Names    prachiti  riya   raj  aditi  rahul  rina  radha  anuj
age            22    23    25     28     29    31     21    24
ratings      4.23  2.32  5.55   2.96   4.32  4.55   6.54  4.44


## 2. axes-returns cols

In [12]:
df3.axes

[RangeIndex(start=0, stop=8, step=1),
 Index(['Names', 'age', 'ratings'], dtype='object')]

## 3. dtype- shows datatypes

In [13]:
df3.dtypes

Names       object
age          int64
ratings    float64
dtype: object

## 4. ndim- returns dimensions

In [14]:
df3.ndim

2

## 5. size - shows lenght and size

In [15]:
df3.size

24

## 6. values - gives values in list

In [16]:
df3.values

array([['prachiti', 22, 4.23],
       ['riya', 23, 2.32],
       ['raj', 25, 5.55],
       ['aditi', 28, 2.96],
       ['rahul', 29, 4.32],
       ['rina', 31, 4.55],
       ['radha', 21, 6.54],
       ['anuj', 24, 4.44]], dtype=object)

## 7. head

In [17]:
df3.head(5)

      Names  age  ratings
0  prachiti   22     4.23
1      riya   23     2.32
2       raj   25     5.55
3     aditi   28     2.96
4     rahul   29     4.32

## 8. tail

In [18]:
df3.tail(4)

   Names  age  ratings
4  rahul   29     4.32
5   rina   31     4.55
6  radha   21     6.54
7   anuj   24     4.44

## 9.sum - if we have oject it will concat that column

In [19]:
df3.sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of       Names  age  ratings
0  prachiti   22     4.23
1      riya   23     2.32
2       raj   25     5.55
3     aditi   28     2.96
4     rahul   29     4.32
5      rina   31     4.55
6     radha   21     6.54
7      anuj   24     4.44>

## 10. axis - it will add the rows , it will take only numeric cols not object cols.

if i put axis=1 it will concat cols

if i put axis = 0 it will add numeric cols

In [20]:
df3.sum(axis=0)

Names      prachitiriyarajaditirahulrinaradhaanuj
age                                           203
ratings                                     34.91
dtype: object

In [21]:
df3.sum(axis=1)

0    26.23
1    25.32
2    30.55
3    30.96
4    33.32
5    35.55
6    27.54
7    28.44
dtype: float64

## 11. max

In [22]:
df3.max()

Names      riya
age          31
ratings    6.54
dtype: object

## 12. min

In [23]:
df3.min()

Names      aditi
age           21
ratings     2.32
dtype: object

## 13. shape

In [24]:
df3.shape

(8, 3)

## 14. mean

In [25]:
df3.mean()

age        25.37500
ratings     4.36375
dtype: float64

## 15. median

In [26]:
df3.median()

age        24.50
ratings     4.38
dtype: float64

# Targeting Columns

#### targeting single and multiple cols

In [27]:
df3

      Names  age  ratings
0  prachiti   22     4.23
1      riya   23     2.32
2       raj   25     5.55
3     aditi   28     2.96
4     rahul   29     4.32
5      rina   31     4.55
6     radha   21     6.54
7      anuj   24     4.44

In [28]:
#single cols

df3['ratings']

0    4.23
1    2.32
2    5.55
3    2.96
4    4.32
5    4.55
6    6.54
7    4.44
Name: ratings, dtype: float64

In [29]:
#multiple cols

df3[['age','ratings']]

   age  ratings
0   22     4.23
1   23     2.32
2   25     5.55
3   28     2.96
4   29     4.32
5   31     4.55
6   21     6.54
7   24     4.44

In [30]:
df3['age'].min()

21

In [31]:
df3['ratings'].mean()

4.3637500000000005

In [32]:
#print information of the datframe

df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Names    8 non-null      object
 1   age      8 non-null      int64
 2   ratings  8 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 320.0+ bytes

In [33]:
#interpretation -

In [34]:
# to see the count mean median s.d of the numeric values in the table we use describe

df3.describe()

             age   ratings
count   8.000000  8.000000
mean   25.375000  4.363750
std     3.583195  1.328317
min    21.000000  2.320000
25%    22.750000  3.912500
50%    24.500000  4.380000
75%    28.250000  4.800000
max    31.000000  6.540000

In [36]:
#count of object in the table

df3.describe(include='object')

           Names
count          8
unique         8
top     prachiti
freq           1

#### drop - is to use to delete row from table

In [37]:
df3.drop([2])

      Names  age  ratings
0  prachiti   22     4.23
1      riya   23     2.32
3     aditi   28     2.96
4     rahul   29     4.32
5      rina   31     4.55
6     radha   21     6.54
7      anuj   24     4.44

In [38]:
#droping column

df3.drop(['ratings'],axis=1)

      Names  age
0  prachiti   22
1      riya   23
2       raj   25
3     aditi   28
4     rahul   29
5      rina   31
6     radha   21
7      anuj   24

In [39]:
#droping row permenantly from table

df3.drop([2],inplace=True)

In [40]:
df3

      Names  age  ratings
0  prachiti   22     4.23
1      riya   23     2.32
3     aditi   28     2.96
4     rahul   29     4.32
5      rina   31     4.55
6     radha   21     6.54
7      anuj   24     4.44

In [41]:
#add col

df3['marks']=[24,26,35,38,84,83,47]

In [42]:
df3

      Names  age  ratings  marks
0  prachiti   22     4.23     24
1      riya   23     2.32     26
3     aditi   28     2.96     35
4     rahul   29     4.32     38
5      rina   31     4.55     84
6     radha   21     6.54     83
7      anuj   24     4.44     47

In [43]:
#rename col

df3.rename(columns={'age':'AGE','Names':'name'},inplace=True)

In [44]:
df3

       name  AGE  ratings  marks
0  prachiti   22     4.23     24
1      riya   23     2.32     26
3     aditi   28     2.96     35
4     rahul   29     4.32     38
5      rina   31     4.55     84
6     radha   21     6.54     83
7      anuj   24     4.44     47